{
  "basics": {
    "name": "Le Nguyen The Dat",
    "label": "Data Scientist, Programmer",
    "email": "me@lenguyenthedat.com",
    "phone": "",
    "website": "http://lenguyenthedat.com",
    "picture": "http://lenguyenthedat.github.io/images/bio-photo.jpg",
    "summary": "",
    "location": {
      "address": "Tanah Merah, Singapore",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "lenguyenthedat",
        "url": "https://sg.linkedin.com/in/lenguyenthedat"
      },
      {
        "network": "Github",
        "username": "lenguyenthedat",
        "url": "https://github.com/lenguyenthedat"
      },
      {
        "network": "Twitter",
        "username": "lenguyenthedat",
        "url": "https://twitter.com/lenguyenthedat"
      },
      {
        "network": "Facebook",
        "username": "lenguyenthedat",
        "url": "https://www.facebook.com/lenguyenthedat"
      }
    ]
  },
  "work": [
    {
      "company": "honestbee",
      "position": "Senior Data Scientist",
      "website": "https://honestbee.com/",
      "startDate": "Jan 2016",
      "endDate": "Present",
      "summary": "Build data warehouse, predictive models, and recommendation systems.",
      "highlights": []
    },
    {
      "company": "Commercialize TV",
      "position": "Senior Data Technologist",
      "website": "http://commercialize.tv",
      "startDate": "Mar 2015",
      "endDate": "Dec 2015",
      "summary": "Built data warehouse, analytics and data science infrastructure from the ground up.",
      "highlights": [
        "Implemented project management and agile software development framework.",
        "Full-stack big data engineer, from DevOps with AWS distributed cloud infrastructure and Docker to programatic ETL and data visualization."
      ]
    },
    {
      "company": "Zalora Group",
      "position": "Head of Data Warehouse & Data Science",
      "website": "http://worldwide.zalora.com",
      "startDate": "May 2014",
      "endDate": "Dec 2014",
      "summary": "In charge of the company's data warehouse, data marts, and data science infrastructure; built and managed the data warehouse as well as data science team.",
      "highlights": []
    },
    {
      "company": "Zalora Group",
      "position": "Data Scientist, Programmer",
      "website": "http://worldwide.zalora.com",
      "startDate": "Jun 2013",
      "endDate": "May 2014",
      "summary": "Zalora's first Data Scientist, specialized in agile software development, cloud computing, data mining, and machine learning algorithms. Designed, built, and was known for:",
      "highlights": [
        "CRM data platform, fully integrated with Oracle Responsys",
        "Recommendation system for Onsite and CRM",
        "Full Data Warehouse infrastructure - hosted on Amazon Web Service: from storage, ETL to data management"
      ]
    },
    {
      "company": "A-STAR Data Storage Institute",
      "position": "Research Engineer",
      "website": "http://www.a-star.edu.sg/dsi/",
      "startDate": "Jul 2011",
      "endDate": "Jun 2013",
      "summary": "Conducted researches, algorithms design and develop full system for multiple projects:",
      "highlights": [
        "Advanced Smart Caching logics dedicated for travel booking industry. Fully implemented, integrated, and deployed, potentially save more than 5% of A-STAR's Business Partner's annual cost",
        "Network Virtualization and Software Defined Network with OpenFlow. Develop and apply new algorithms for efficient traffic routing, load balancing, virtual machine placement techniques in scalable data center network",
        "Knowledge based data classification and recommendation system, built on top of Apache Mahout's collaborative filtering engine. Implemented functional and scalable Java / Python prototypes for travel industry with social network's data set"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of Oxford, United Kingdom",
      "area": "Computer Science",
      "studyType": "Master of Science",
      "startDate": "Sep 2009",
      "endDate": "Oct 2010",
      "courses": []
    },
    {
      "institution": "University of Nottingham, United Kingdom",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "Sep 2007",
      "endDate": "Jul 2009",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Dextra: Rakuten Viki Challenge",
      "date": "Sep 2015",
      "website":"http://www.dextra.sg/rakuten-viki-global-tv-recommender-challenge/",
      "awarder": "Finalist"
    },
    {
      "title": "Dextra: Singapore Ministry of Defense Data Analytics Challenge",
      "date": "Aug 2015",
      "website":"http://www.dextra.sg/challenges/ministry-of-defence-data-analytics-challenge/",
      "awarder": "First Prize ($5000)"
    }
  ],
  "publications": [
    {
      "name": "Software defined network based adaptive routing for data replication in Data Centers",
      "publisher": "IEEE International Conference on Networks, ICON 2013, Singapore",
      "releaseDate": "11 Dec 2013",
      "website": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?arnumber=6781967",
      "summary": ""
    },
    {
      "name": "Virtual machine placement with two-path traffic routing for reduced congestion in data center networks",
      "publisher": "Computer Communications Vol.53",
      "releaseDate": "1 Nov 2014",
      "website": "http://www.sciencedirect.com/science/article/pii/S0140366414002746",
      "summary": ""
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "",
      "keywords": [
        "Python",
        "Shell Scripts",
        "SQL",
        "Haskell",
        "Java",
        "R"
      ]
    },
    {
      "name": "Data Science",
      "level": "",
      "keywords": [
        "Recommendation System",
        "Predictive Modeling",
        "Scikit-Learn - XGBoost - Neural Networks"
      ]
    },
    {
      "name": "Others",
      "level": "",
      "keywords": [
        "Data Infrastructure",
        "Distributed System",
        "Amazon Web Services",
        "Docker",
        "Agile Development"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "Vietnamese",
      "fluency": "Native"
    }
  ],
  "interests": [
    {
      "name": "Photography"
    },
    {
      "name": "Kaggle challenges"
    }
  ],
  "references": [
    {
      "name": "Corentin Roux dit Buisson, Vice President - Business Intelligence, Zalora Singapore",
      "reference": "Dat was our first hire into Data Science. His interview task code set the tone: he first submitted solutions in Haskell, then taught himself Python in 3 days and resubmitted in Python. He was incredibly productive from the outset. In 2 hours, he taught himself Amazon Redshift then built a data warehouse which allowed the email team to integrate their mailing solution provider seamlessly in a matter of days. He still manages this data warehouse on his own, in his spare time; rebranded Redcat, it feeds all the products built by Data Science as well as other analysts in the company and contains a copy of practically all the company's data, all the way to customer service call recordings. He also wrote the recommendation algorithms currently running on the site, once again having not done this kind of work before. I learnt a lot just from listening to him explaining his R&D approach for that project. Working with Dat is always the same experience: you give him a high level spec, sit back, and the product comes back quickly, showing an understanding of your actual problem instead of the one you thought you had. I've also noticed him fixing import issues due to third parties (since his own code is rock solid) at 3 in the morning, and turning up cheerfully the next day as if nothing had happened. There's evidence of his work in all departments from Marketing to Buying, and everybody agrees that he has become a key part of the company's success and growth. It is not often that you can say that you feel privileged to have worked with somebody. It was most definitely a real, rare honour to have had the chance to work with Dat, and I always saw our relationship less as employee/employer and more as having the chance to rent extraordinary talent at cut throat pricing and getting a fantastic return on investment. Even if he studied at the Other Place."
    },
    {
      "name": "Christian Eik, Associate Director - Buying Budgeting & Data Analytics, Zalora Group",
      "reference": "Dat set up and managed the AWS Redshift DWH at Zalora, which allowed my team to restructure and put all reporting and planning processes on a much better foundation. He cares a lot about his work, products, and technology and possesses a high level of intellectual curiosity. Deeply committed, Dat will get things done on time, no matter what. Working with him on the DWH was one of the most enjoyable and educational projects for me at Zalora. Dat will be a great addition to any Data Team or the guy you want to hire to set one up."
    }
  ]
}